const map1Text = '' + 
'壁壁壁壁壁壁壁壁壁\n' + 
'壁、、、、、、Ｍ壁\n' + 
'壁Ｍ、、、、、、壁\n' + 
'壁、、、、、、、壁\n' + 
'壁、、、、、、、壁\n' + 
'壁、、、、、、、壁\n' + 
'壁、、、、Ｍ、、壁\n' + 
'壁、、、、、、、壁\n' + 
'壁、、、、、、、壁\n' + 
'壁Ｍ、、、、Ｍ、壁\n' + 
'壁、、、、、Ｍ箱壁\n' +
'壁壁壁壁、壁壁壁壁\n' +
'黒黒黒壁黒壁黒黒黒'

const homemap = ''+
'黒黒黒黒黒黒壁黒壁黒黒黒黒黒黒黒黒黒黒\n' +
'壁壁壁壁壁壁壁、壁壁壁壁壁壁壁壁壁壁壁\n' +
'壁、、、、、、、ＭＭ、、、、、、、、壁\n' +
'壁、、、、、、、、ＭＭ、、、、、、、壁\n' +
'壁、、、、、、、、Ｍ、、、、、、、、壁\n' +
'壁Ｍ、、、、、、、糞、、、、、、、、壁\n' +
'壁、、、、、、、Ｍ、、、、、、、、、壁\n' +
'壁、、、、、、ＭＭ、、、、、、、、、壁\n' +
'壁壁壁、壁壁壁壁壁壁壁壁壁壁壁壁、壁壁\n' +
'黒黒壁、壁黒黒黒黒黒黒黒黒黒黒壁、壁黒\n' +
'黒黒壁、壁黒黒黒黒黒黒黒黒黒黒壁、壁黒\n' +
'壁壁壁、壁壁壁壁壁壁壁壁壁壁壁壁、壁壁\n' +
'壁、、、、、棚棚画棚棚棚棚棚壁、、、壁\n' +
'壁、、、、、、画医画、、Ｍ、壁、、、壁\n' +
'壁、Ｍ、、、、、、、、、棚棚壁、、、壁\n' +
'壁、、Ｍ、、、、、、、、、、壁、、、壁\n' +
'壁Ｍ、Ｍ、、、画、画、Ｍ棚棚壁、、、壁\n' +
'壁箱、Ｍ、、棚棚画棚、、、、壁、、、壁\n' +
'壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁\n' 
