const map1Text = '' + 
'壁壁壁壁壁壁壁壁壁\n' + 
'壁Ｍ、、ＭＭ、Ｍ壁\n' + 
'壁Ｍ、Ｍ、Ｍ、、壁\n' + 
'壁、、、、、、、壁\n' + 
'壁、、、、、、、壁\n' + 
'壁、、、、、、、壁\n' + 
'壁、、、、Ｍ、、壁\n' + 
'壁、、、、、、、壁\n' + 
'壁、、、、、、、壁\n' + 
'壁Ｍ、、、、Ｍ、壁\n' + 
'壁ＭＭ、、、Ｍ箱壁\n' +
'壁壁壁壁、壁壁壁壁\n' +
'黒黒黒壁黒壁黒黒黒';

const homemap = ''+
'黒黒黒黒黒黒壁黒壁黒黒黒黒黒壁黒壁黒黒黒\n' +
'壁壁壁壁壁壁壁、壁壁壁壁壁壁壁戸壁壁壁黒\n' +
'壁、、、、、、、ＭＭＭＭ、、、、ＭＭ壁黒\n' +
'壁、ＭＭ、、、、、ＭＭ、、、、、、、壁黒\n' +
'壁、、、、、、、、ＭＭＭ、、、、、、壁壁\n' +
'壁Ｍ、、、、、、、糞、、、、、、、、、黒\n' +
'壁、、、、、、、ＭＭＭ、、、、、、、壁壁\n' +
'壁、、、、、、ＭＭＭＭ、、ＭＭ、、、壁黒\n' +
'壁壁壁、壁壁壁壁壁壁壁壁壁壁壁、、、壁黒\n' +
'黒黒壁、壁黒黒黒黒黒黒黒黒黒壁、、Ｍ壁黒\n' +
'黒黒壁、壁黒黒黒黒黒黒黒黒黒壁ＭＭＭ壁黒\n' +
'壁壁壁、壁壁壁壁壁壁壁壁壁壁壁ＭＭ、壁黒\n' +
'壁、、、、、棚棚画棚棚棚棚棚壁、、、壁黒\n' +
'壁、、、、、、画医画、、Ｍ、壁、、Ｍ壁黒\n' +
'壁、Ｍ、、、、、、、、、棚棚壁、、、壁黒\n' +
'壁、、Ｍ、、、、、、、、、、壁、、、壁黒\n' +
'壁Ｍ、Ｍ、、、画、画、Ｍ棚棚壁、、、壁黒\n' +
'壁箱、Ｍ、、棚棚面棚、、、、壁、、、壁黒\n' +
'壁壁壁壁壁壁壁壁壁壁戸壁壁壁壁、、、壁黒\n' +
'壁、、、、、、、、、、、、、壁、、、壁黒\n' +
'壁、、、、、、、、、、、、、壁、、、壁黒\n' + 
'壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁黒';

const map3 = ''+
'黒黒壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁\n' +
'黒黒壁、、、、、壁、、、壁、、、、、壁\n' +
'黒黒壁、、、、、、、、、、、、、、、壁\n' +
'黒黒壁、、、、、壁、、、壁、、、、、壁\n' +
'黒黒壁、、、、、壁、、、壁、、、、、壁\n' +
'黒黒壁壁壁壁壁壁壁、、、壁壁壁壁壁壁壁\n' +
'壁壁壁、、、、、、、、、、、、、、、壁\n' +
'黒、、、、、、、、、、、、、、、、、壁\n' +
'壁壁壁、、、、、、、、、、、、、、、壁\n' +
'黒黒壁壁壁壁壁、、、壁壁壁壁壁、、、壁\n' +
'黒黒壁、、、、、、、、、、、壁、、、壁\n' +
'黒黒壁、、、、、、、、、、、壁、、、壁\n' +
'黒黒壁、、、、、、、、、、、壁壁壁壁壁\n' +
'黒黒壁、、、、、、、、、、、、、、、壁\n' +
'黒黒壁、、、、、、、、、、、、、、、壁\n' +
'黒黒壁、、、、、、、、、、、、、、、壁\n' +
'黒黒壁、、、、、、、、、、、、、、、壁\n' +
'黒黒壁、、、、、、、、、、、、、、、壁\n' +
'黒黒壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁壁';


let maps = [
  {
    text:map1Text,
    obj:null
  },
  {
    text:homemap,
    obj:null
  },
  {
    text:map3,
    obj:null
  }
  
  
  ];
